IDEA StatiCa Open Model
ConnectionSetup.BracedSystem Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Consider the frame system as braced for stiffness calculation. Braced system reduces horizontal displacements.
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool BracedSystem { get; set; }
Public Property BracedSystem As Boolean
	Get
	Set
public:
property bool BracedSystem {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace